In [1]:
import pandas as pd

In [2]:
sal = pd.read_csv(r'C:\Users\longn\Python_programming\Unit_6\homework\Salaries.csv')

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
#Use the .info() method to find out how many entries there are.

sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [5]:
# What is the average BasePay
sal.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [6]:
# What is the average BasePay
sal['BasePay'].mean()

66325.44884050643

In [7]:
# What is the highest amount of OvertimePay in the dataset ?
sal['OvertimePay'].max()

245131.88

In [8]:
#What is the job title of JOSEPH DRISCOLL ?
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [9]:
# How much does JOSEPH DRISCOLL make (including benefits)?
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [10]:
#What is the name of highest paid person (including benefits)?

sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [11]:
#What is the name of lowest paid person (including benefits)? 



sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [12]:
#Do you notice something strange about how much he or she is paid?
sal[sal['EmployeeName']=='Joe Lopez']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [13]:
#her salary is negative

In [14]:
#What was the average (mean) BasePay of all employees per year? (2011-2014) ?
yearly = sal.groupby('Year')

In [15]:
yearly.mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [16]:
#How many unique job titles are there?
sal['JobTitle'].nunique()

2159

In [17]:
#What are the top 5 most common jobs?

commonjobs = sal.groupby('JobTitle')

In [18]:
mostcommon = commonjobs['JobTitle'].count().sort_values(ascending = False)

In [19]:
mostcommon

JobTitle
Transit Operator                          7036
Special Nurse                             4389
Registered Nurse                          3736
Public Svc Aide-Public Works              2518
Police Officer 3                          2421
                                          ...
DIRECTOR, EMPLOYEE RELATIONS DIVISION        1
DIRECTOR, FISCAL SERVICES                    1
DIRECTOR, HUMAN RESOURCES                    1
DIRECTOR, INFORMATION TECHNOLOGY GROUP       1
ZOO CURATOR                                  1
Name: JobTitle, Length: 2159, dtype: int64

In [20]:
sal['JobTitle'].value_counts()

Transit Operator                                    7036
Special Nurse                                       4389
Registered Nurse                                    3736
Public Svc Aide-Public Works                        2518
Police Officer 3                                    2421
                                                    ...
BUILDING SERVICES TECHNICIAN                           1
SIGNAL AND SYSTEMS ENGINEER                            1
ASST. CHIEF PROBATION OFFICER-JUVENILE PROBATION       1
BARBER                                                 1
MANAGER, UNIFIED FAMILY COURT SERVICES                 1
Name: JobTitle, Length: 2159, dtype: int64

In [21]:
#How many Job Titles were represented by only one person in 2013?

commonjobs_frame = pd.DataFrame(mostcommon)

In [22]:
commonjobs_frame

                                        JobTitle
JobTitle
Transit Operator                            7036
Special Nurse                               4389
Registered Nurse                            3736
Public Svc Aide-Public Works                2518
Police Officer 3                            2421
...                                          ...
DIRECTOR, EMPLOYEE RELATIONS DIVISION          1
DIRECTOR, FISCAL SERVICES                      1
DIRECTOR, HUMAN RESOURCES                      1
DIRECTOR, INFORMATION TECHNOLOGY GROUP         1
ZOO CURATOR                                    1

[2159 rows x 1 columns]

In [23]:
commonjobs_frame[commonjobs_frame['JobTitle']==1].count()

JobTitle    239
dtype: int64

In [24]:
#How many people have the word Chief in their job title? (This is pretty tricky)
#write function lookking for word in string

def chief(input):
    yes = 0
    if 'Chief' in input or 'CHIEF' in input :
        yes = 1
    return yes

In [25]:
#create chief column: if chief in title -> value = 1
sal['chief'] = sal['JobTitle'].apply(chief)

In [28]:
sal[sal['chief']==1].count()[['Id']]

Id    627
dtype: int64

In [27]:
#Bonus: Is there a correlation between length of the Job Title string and Salary?